//弃用

// export const INPUT = {
//     /**
//      * 数字
//      */
//     NUMBER:1,
//     /**
//      * 字母
//      */
//     ALPHABET:2,
//     /**
//      * 中文
//      */
//     CHINESE:3,
//     /**
//      * 符号
//      */
//     SYMBOL:4,
//     /**
//      * 账号(数字+字母)
//      */
//     ACCOUNT:5,
//     /**
//      * 昵称(数字+字母+中文)
//      */
//     NICKNAME:6
// };
//
// export const TEST = {
//     /**
//      * 账号
//      */
//     ACCOUNT:1,
//     /**
//      * 密码
//      */
//     PASSWORD:2,
//     /**
//      * 中文名
//      */
//     CNNAME:3,
//     /**
//      * 昵称
//      */
//     NICKNAME:4,
//     /**
//      * 银行卡
//      */
//     BANKCARD:5,
//     /**
//      * 验证码
//      */
//     CAPTCHA:6,
//     /**
//      * 手机号
//      */
//     PHONE:7,
// };